In [189]:
import numpy as np

import pandas as pd



exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

dataframe = pd.DataFrame(exam_data)

row = dataframe.head(3)

print(row)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

In [190]:
dataframe.dropna(inplace=True)
print(dataframe)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [191]:
mere = dataframe.iloc[:,[0,1]]
print(mere)

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
8      Kevin    8.0
9      Jonas   19.0

In [192]:
add = dataframe.loc['k'] = ['Suresh',15.5,1,"yes"]

In [193]:
dataframe.pop("attempts")

0    1
1    3
2    2
4    2
5    3
6    1
8    2
9    1
k    1
Name: attempts, dtype: int64

In [194]:
Success = []



for row in dataframe['score']:
        if row > 10 :
            Success.append(1)
        else:
            Success.append(0)
dataframe ["Success"] = Success 
dataframe

        name  score qualify  Success
0  Anastasia   12.5     yes        1
1       Dima    9.0      no        0
2  Katherine   16.5     yes        1
4      Emily    9.0      no        0
5    Michael   20.0     yes        1
6    Matthew   14.5     yes        1
8      Kevin    8.0      no        0
9      Jonas   19.0     yes        1
k     Suresh   15.5     yes        1

In [166]:
dataframe.to_csv("C:/Users/Hassan/Desktop/my_data")